Repository: pingfangx/TranslatorX
Catalog: JetBrains/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Enter new directory name:
zh_cn: 输入新目录名称:

source: Enter new library name
zh_cn: 输入新库名称

source: Enter new module name
zh_cn: 输入新模块名称

source: Enter new package name:
zh_cn: 输入新的包名称:

source: Enter new project name:
zh_cn: 输入新项目的名称:

source: Enter parameters:
zh_cn: 输入参数:

source: Enter relative path to module content root (example: java{0}src):
zh_cn: 输入模块内容根的相对路径 (例如: java{0}src):

source: Enter short bookmark description
zh_cn: 输入简短的书签描述

source: Enter symbol name:
zh_cn: 输入符号名称:

source: Enter tag name:
zh_cn: 输入标签名称:

source: Enter the expression
zh_cn: 输入表达式

source: Enter the filter pattern:
zh_cn: 输入过滤器模式:

source: Enter the name of the package or class to exclude from auto-import and class name completion:
zh_cn: 输入要从自动导入和类名补全中排除的包或类的名称：

source: Enter type name:
zh_cn: 输入类名：

source: Enter {0} License
zh_cn: 输入 {0} 许可证

source: Enter {0} file location
zh_cn: 输入 {0} 文件位置

source: Enter {0} name:
zh_cn: 输入 {0} 名称：

source: Entitled for free updates and upgrades until {0,date,MMMM dd, yyyy}
zh_cn: 享有免费更新和升级至 {0,date,yyyy-MM-dd}

source: Entitled for free updates and upgrades until {0}
zh_cn: 授权免费更新和升级至 {0}

source: Entity reference
zh_cn: 实体引用

source: Entry Points
zh_cn: 入口点

source: Entry in the classpath the element belongs to
zh_cn: 元素所属的类路径中的条目

source: Entry in the sourcepath the element belongs to
zh_cn: 在元素所属的源路径中输入

source: Enum
zh_cn: 枚举

source: Enum constant ''{0}'' in ''{1}''
zh_cn: 在 ''{1}'' 中的枚举常量 ''{0}''

source: Enum constants
zh_cn: 枚举常量

source: Enum is not allowed
zh_cn: 枚举类型是不允许的

source: Enum may not have type parameters
zh_cn: 枚举不应有类型参数

source: Enum must not be local
zh_cn: 枚举不能是本地的

source: Enum types cannot be instantiated
zh_cn: 枚举类型无法实例化

source: Enumeration value
zh_cn: 枚举值

source: Environment Variables
zh_cn: 环境变量

source: Equality operators (==, !=)
zh_cn: 等式运算符 (==, !=)

source: Error
zh_cn: 错误

source: Error Adding Files
zh_cn: 添加文件时错误

source: Error Copying File
zh_cn: 复制文件时出错

source: Error Creating Deployment Item: {0}
zh_cn: 创建部署项目时出错: {0}

source: Error Highlighting
zh_cn: 错误高亮显示

source: Error Loading Default Project
zh_cn: 加载默认项目时出错

source: Error Reading File
zh_cn: 读取文件错误

source: Error Report
zh_cn: 错误报告

source: Error While Fetching
zh_cn: 获取时出错

source: Error While Fetching Dependent Resource
zh_cn: 获取依赖资源时出错

source: Error Writing File
zh_cn: 写入文件错误

source: Error adding module to project: {0}
zh_cn: 将模块添加到项目中时出错: {0}

source: Error analysis is in progress
zh_cn: 错误分析正在进行中

source: Error at line {0}: {1}
zh_cn: 错误发生于 {0}: {1}

source: Error cleaning quarantine status
zh_cn: 清理隔离状态时出错

source: Error connecting to remote process.
zh_cn: 连接到远程进程的错误。

source: Error copying ''{0}'' to ''{1}''.
zh_cn: 复制 ''{0}'' 到 ''{1}'' 错误。

source: Error copying {0} to {1}: {2}
zh_cn: 复制错误 {0} 到 {1}: {2}

source: Error creating patch: {0}
zh_cn: 创建补丁错误:{0}

source: Error creating properties file
zh_cn: 创建属性文件时出错

source: Error during patch creation: {0}
zh_cn: 补丁创建期间出错：{0}

source: Error during revert: {0}
zh_cn: 恢复期间出错：{0}

source: Error evaluating field : ''{0}''
zh_cn: 解析字段错误 :''{0}''

source: Error evaluating method : ''{0}''
zh_cn: 解析方法错误 :''{0}''

source: Error executing ''{0}'': {1}
zh_cn: 执行错误 ''{0}'':{1}

source: Error getting value: {0}
zh_cn: 获取值错误：{0}

source: Error handling
zh_cn: 错误处理

source: Error highlighting
zh_cn: 错误高亮显示

source: Error loading patch file: {0}
zh_cn: 加载补丁文件时错误:{0}

source: Error loading patch file: {0} at line {1}
zh_cn: 加载补丁文件时错误:{0} 行 {1}

source: Error loading plugins: {0} Plugins were not loaded.
zh_cn: 加载插件时出错: {0} 插件没有安装。

source: Error opening patch file: {0}
zh_cn: 打开补丁文件时错误:{0}

source: Error parsing file template: {0}
zh_cn: 解析文件模板时出错：{0}

source: Error reading color scheme from {0}
zh_cn: 从 {0} 读取颜色方案时出错

source: Error reading file {0}.
zh_cn: 读取文件 {0} 时出错。

source: Error reading inspection profile {0, choice, 0#from {1}|1#}
zh_cn: 读取配置文件 {0, choice, 0#from {1}|1#} 错误

source: Error report sending failed.
zh_cn: 错误报告发送失败了。

source: Error running ''{0}''
zh_cn: 运行 ''{0}'' 出错

source: Error running {0}
zh_cn: 运行 {0} 时出错

source: Error saving license data.
zh_cn: 保存许可数据时出错。

source: Error saving system information: {0}
zh_cn: 保存系统信息时出错: {0}

source: Error setting value: {0}
zh_cn: 设置值错误：{0}

source: Error stripe mark
zh_cn: 错误条纹标记

source: Error stripe mark min height (pixels):
zh_cn: 错误条纹标记最小高度(像素)：

source: Error updating changes: {0}
zh_cn: 更新更改时错误:{0}

source: Error while doing early return: {0}
zh_cn: 提前返回时出错：{0}

source: Error while executing finally blocks: {0}
zh_cn: 执行 finally 块时出错：{0}

source: Error while fetching {0}
zh_cn: 当获取 {0} 时发生错误

source: Error while loading external changes: {0}.
zh_cn: 加载外部更改时出错：{0}。

source: Error while throwing exception: {0}
zh_cn: 抛出异常时出错：{0}

source: Error writing settings.
zh_cn: 写入设置错误。

source: Error writing to file ''{0}''.
zh_cn: 写入文件错误 ''{0}''。

source: Error writing to file: {0}
zh_cn: 写入文件时出错: {0}

source: Error writing to {0}: {1}
zh_cn: 错误写入 {0}: {1}

source: Error:
zh_cn: 错误:

source: Error: can't show diff
zh_cn: 错误：无法显示差异

source: Error: {0}
zh_cn: 错误: {0}

source: Errors
zh_cn: 错误

source: Errors Occurred
zh_cn: 错误出现

source: Errors and Warnings//Deprecated symbol
zh_cn: 错误和警告//弃用的符号

source: Errors and Warnings//Deprecated symbol marked for removal
zh_cn: 错误和警告//弃用的符号标记为移除

source: Errors and Warnings//Duplicate from server
zh_cn: 错误和警告//服务器重复

source: Errors and Warnings//Error
zh_cn: 错误和警告//错误

source: Errors and Warnings//Problem from server
zh_cn: 错误和警告//服务器问题

source: Errors and Warnings//Unknown symbol
zh_cn: 错误和警告//未知符号

source: Errors and Warnings//Unused symbol
zh_cn: 错误和警告//未使用的符号

source: Errors and Warnings//Warning
zh_cn: 错误和警告//警告

source: Errors and Warnings//Weak Warning
zh_cn: 错误和警告//弱警告

source: Errors and Warnings//{0}
zh_cn: 错误和警告//{0}

source: Errors occurred
zh_cn: 发生错误

source: Errors: ''{0}'' inspection profile
zh_cn: 错误:''{0}'' 检查配置文件

source: Escape
zh_cn: Esc

source: Escape ampersand
zh_cn: 转义符号

source: Escape {0}
zh_cn: 转义 {0}

source: Evaluate
zh_cn: 计算

source: Evaluate Code Fragment
zh_cn: 解析代码片段

source: Evaluate E_xpression...
zh_cn: 计算表达式...(_X)

source: Evaluate Expression
zh_cn: 计算表达式

source: Evaluate In Console
zh_cn: 在控制台计算

source: Evaluate arbitrary expression
zh_cn: 计算任意表达式

source: Evaluate finally blocks on pop frame and early return:
zh_cn: 在弹出桢和提前返回时解析 finally 块：

source: Evaluate in Console
zh_cn: 在控制台计算

source: Evaluate selected expression
zh_cn: 计算选中表达式

source: Evaluated expression text
zh_cn: 计算的表达式的文本

source: Evaluated expression text for execution line
zh_cn: 执行行的计算表达式文本

source: Evaluating {0}
zh_cn: 计算 {0}

source: Evaluating...
zh_cn: 计算...

source: Evaluating…
zh_cn: 计算…

source: Evaluation License Expired
zh_cn: 评估许可证已过期

source: Evaluation is not supported during another method''s evaluation
zh_cn: 在另一人方法的计算中，计算是不支持的

source: Evaluation of methods is not possible in this mode
zh_cn: 在这种模式下，对方法的解析是不可能的。

source: Evaluation of {0}
zh_cn: 计算 {0}

source: Even number of pages per file (for duplex printing)
zh_cn: 每个文件的偶数页数(双面打印)

source: Every parameter and local variable can be highlighted with its own color.
zh_cn: 每个参数和局部变量都可以用自己的颜色突出显示。

source: Ex.
zh_cn: 如。

source: Example: *.domain.com, 192.168.*
zh_cn: 例如: *.domain.com, 192.168.*

source: Example\&nbsp;of\&nbsp;use:<br><pre>{0}</pre>
zh_cn: 例如 \&nbsp;of\&nbsp;使用:<br><pre>{0}</pre>

source: Except Comments
zh_cn: 除了注释

source: Except Comments and String Literals
zh_cn: 除了注释和字符串

source: Except String Literals
zh_cn: 除了字符串

source: Exception
zh_cn: 异常

source: Exception ''{0}'' in thread ''{1}''
zh_cn: 线程 ''{1}'' 中的异常 ''{0}''

source: Exception ''{0}'' has already been caught
zh_cn: 异常 ''{0}'' 已经被捕获

source: Exception ''{0}'' is never thrown in the corresponding try block
zh_cn: 异常 ''{0}'' 不会在相应的 try 块中抛出

source: Exception ''{0}'' is never thrown in the method
zh_cn: 异常 ''{0}'' 不会在方法中抛出

source: Exception ''{0}'' occurred at {1}({2})
zh_cn: 异常 ''{0}'' 发生于 {1}({2})

source: Exception ''{0}'' occurred at {1}({2}:{3,number,#})
zh_cn: 异常 ''{0}'' 发生在 {1}({2}:{3,number,#})

source: Exception ''{0}'' occurred in thread ''{1}'' at {2}({3})
zh_cn: 异常 ''{0}'' 发生于线程 ''{1}'' 在 {2}({3})

source: Exception ''{0}'' occurred in thread ''{1}'' at {2}({3}:{4,number,#})
zh_cn: 异常 ''{0}'' 发生于线程 ''{1}'' 在 {2}({3}:{4,number,#})

source: Exception breakpoint reached
zh_cn: 异常断点达到

source: Exception class expected
zh_cn: 期望异常类

source: Exception in <b>unknown plugin</b>.
zh_cn: 异常在 <b>未知插件</b>。

source: Exception in <b>{0} core</b>.
zh_cn: 错误在 <b>{0} 核心</b>。

source: Exception in plugin <b>{0}</b>.
zh_cn: 错误在插件 <b>{0}</b>。

source: Exception occurred: {0} Exception message: {1}
zh_cn: 异常发生: {0} 异常消息: {1}

source: Exception while reloading classes : {0} : {1}
zh_cn: 当重新加载类时异常: {0} : {1}

source: Exceptions
zh_cn: 异常

source: Excessive lambda usage
zh_cn: 过度的 lambda 使用

source: Exclude
zh_cn: 排除

source: Exclude All
zh_cn: 排除全部

source: Exclude From Project...
zh_cn: 从项目中排除...

source: Exclude Lines from Commit
zh_cn: 从提交排除行

source: Exclude Package
zh_cn: 排除包

source: Exclude Recursively
zh_cn: 递归排除

source: Exclude classes
zh_cn: 排除类

source: Exclude files:
zh_cn: 排除文件：

source: Exclude from Commit
zh_cn: 从提交中排除

source: Exclude from Compile
zh_cn: 从编译中排除

source: Exclude from Import and Completion
zh_cn: 从导入和补全中排除

source: Exclude from Validation
zh_cn: 从验证中排除

source: Exclude from commit
zh_cn: 从提交中排除

source: Exclude from import and completion:
zh_cn: 从导入和补全中排除：

source: Exclude output paths
zh_cn: 排除输出路径

source: Exclude this usage(s) from processing
zh_cn: 将这些使用排除出去

source: Excluded
zh_cn: 排除

source: Excluded Folders
zh_cn: 排除的文件夹

source: Executable is not specified
zh_cn: 可执行文件未指定

source: Execute Current Statement in Multiline Console
zh_cn: 在多行控制台执行当前语句

source: Execute Current Statement in One-Line Console
zh_cn: 在单行控制台执行当前语句

source: Execute Finally Blocks
zh_cn: 执行 finally 块

source: Execute Target Before Run/Debug
zh_cn: 运行/调试之前执行目标

source: Execute current statement in multiline console
zh_cn: 在多行控制台执行当前语句

source: Execute current statement in one-line console
zh_cn: 在单行控制台执行当前语句

source: Execute on
zh_cn: 执行

source: Execute {0} Before Run/Debug
zh_cn: 运行/调试前执行 {0}

source: Executing post-compile tasks...
zh_cn: 执行编译后的任务...

source: Executing pre-compile tasks...
zh_cn: 执行预编译任务...

source: Executing task: {0}
zh_cn: 执行任务: {0}

source: Execution
zh_cn: 执行

source: Execution line
zh_cn: 执行行

source: Execution point
zh_cn: 执行点

source: Existing Templates
zh_cn: 现有模板

source: Exit
zh_cn: 退出

source: Exit Distraction Free Mode
zh_cn: 退出免打扰模式

source: Exit Full Screen
zh_cn: 退出全屏

source: Exit Presentation Mode
zh_cn: 退出演示模式

source: Exit Presentation mode
zh_cn: 退出演示模式

source: Expand &abbreviation with
zh_cn: 展开缩写用(&A)

source: Expand All
zh_cn: 全部展开

source: Expand Live Template / Emmet Abbreviation
zh_cn: 展开代码模板/Emmet 缩写

source: Expand Live Template by Tab
zh_cn: 按 Tab 展开代码模板

source: Expand Panel
zh_cn: 展开面板

source: Expand Tree Node
zh_cn: 展开树节点

source: Expand _Recursively
zh_cn: 递归展开(_R)

source: Expand _doc comments
zh_cn: 展开 doc 注释(_D)

source: Expand all build file nodes
zh_cn: 展开所有构建文件节点

source: Expand all documentation comments
zh_cn: 展开所有的文档注释

source: Expand all folding regions (in selection)
zh_cn: 全部展开可折叠区域(选中部分的)

source: Expand all test suites
zh_cn: 展开所有测试程序组

source: Expand all to _level
zh_cn: 全部展开到层次(_L)

source: Expand block at caret recursively
zh_cn: 在插入符号处递归展开块

source: Expand folding region at caret
zh_cn: 在插入符号处展开可折叠区域

source: Expand tag
zh_cn: 扩展标签

source: Expand the node and select child items to manage Module libraries.<br><br> To attach a library to a module, select that module, click the Dependencies tab, click Add and specify the library location.
zh_cn: 展开节点并选择子项目以管理项目库。<br><br>要将库附加到模块，请选择该模块，单击依赖关系选项卡，单击添加并指定库位置。

source: Expand to l_evel
zh_cn: 展开到层次(_E)

source: Expanding necessary children indents
zh_cn: 扩大必要的子项缩进

source: Expected
zh_cn: 期望

source: Expected :
zh_cn: 期望:

source: Expected class or package
zh_cn: 期望类或包

source: Expected parameters: <project_file_path> <inspection_profile> <output_path> <inspections_profile> -- use here profile name configured in the project or locally or path to the inspection profile; can be stabbed when one of the -e|-profileName|-profilePath is used [<options>]
zh_cn: 预期参数: <project_file_path> <inspection_profile> <output_path> <inspections_profile> -- use here profile name configured in the project or locally or path to the inspection profile; can be stabbed when one of the -e|-profileName|-profilePath is used [<options>]

source: Expected type of expression (regexp):
zh_cn: 期望的表达式类型(正则表达式)：

source: Experimental features...
zh_cn: 实现功能...

source: Expiration date: {0}
zh_cn: 截止日期: {0}

source: Explicit argument can be converted to function
zh_cn: 显式参数可以转换为函数

source: Explicit type arguments can be inferred
zh_cn: 可以推断显式类型参数

source: Explicitly locked files
zh_cn: 显式锁定的文件

source: Export
zh_cn: 导出

source: Export As
zh_cn: 导出为

source: Export Complete
zh_cn: 导出完成

source: Export File Location
zh_cn: 导出到文件

source: Export Preview
zh_cn: 导出预览

source: Export Settings
zh_cn: 导出设置

source: Export T_hreads...
zh_cn: 导出线程...(_H)

source: Export Test Results
zh_cn: 导出测试结果

source: Export Test Results...
zh_cn: 导出测试结果...

source: Export Threads
zh_cn: 导出线程

source: Export To
zh_cn: 导出到

source: Export To Eclipse...
zh_cn: 导出到 Eclipse...

source: Export failed: {0}
zh_cn: 导出失败: {0}

source: Export global settings
zh_cn: 导出全局设置

source: Export settings to:
zh_cn: 导出设置:

source: Export test results to the file
zh_cn: 将测试结果导出到文件

source: Export to
zh_cn: 导出到

source: Export to HTML
zh_cn: 导出到 HTML

source: Export to Text File
zh_cn: 导出到文本文件

source: Export to _HTML...
zh_cn: 导出到 HTML...(_H)

source: Export to file
zh_cn: 导出到文件

source: Export to file...
zh_cn: 导出到文件...

source: Export to file:
zh_cn: 导出到文件:

source: Export...
zh_cn: 导出...

source: Export/Import Actions
zh_cn: 导出/导入操作

source: Exporting test results
zh_cn: 导出测试结果

source: Expression
zh_cn: 表达式

source: Expression &Mode
zh_cn: 表达式模式(&M)

source: Expression <code>#ref</code> might evaluate to null but is assigned to a variable that is annotated with @NotNull
zh_cn: 表达式 <code>#ref</code> 可以计算为 null ，但它分配给使用 @NotNull 注解的变量

source: Expression <code>#ref</code> might evaluate to null but is returned by the method declared as @{0}
zh_cn: 表达式 <code>#ref</code> 可能会计算为 null，但是由声明为 @{0} 的方法返回

source: Expression <code>#ref</code> might evaluate to null but is returned by the method which is not declared as @{0}
zh_cn: 表达式 <code>#ref</code> 可以计算为 null ，但它由未申明为 @{0} 的方法返回

source: Expression <code>#ref</code> might evaluate to null but is stored to an array of @NotNull elements
zh_cn: 表达式 <code>#ref</code> 可能计算为空，却保存到元素 @NotNull 的数组

source: Expression Evaluation
zh_cn: 表达式计算

source: Expression Language//Background
zh_cn: 表达式语言//背景

source: Expression Language//Bounds
zh_cn: 表达语言//界限

source: Expression Language//Brackets
zh_cn: 表达式语言//括号

source: Expression Language//Comma
zh_cn: 表达式语言//逗号

source: Expression Language//Dot
zh_cn: 表达式语言//点

source: Expression Language//Identifier
zh_cn: 表达式语言//标识符

source: Expression Language//Keyword
zh_cn: 表达式语言//关键字

source: Expression Language//Number
zh_cn: 表达式语言//数字

source: Expression Language//Parentheses
zh_cn: 表达式语言//括号

source: Expression Language//String
zh_cn: 表达式语言//字符串

source: Expression constraints
zh_cn: 表达式限制

source: Expression expected
zh_cn: 期望表达式

source: Expression operand unknown: {0}
zh_cn: 表达式操作数未知：{0}

source: Expression type (regexp):
zh_cn: 表达式类型(正则表达式)：

source: Expression type unknown: {0}
zh_cn: 表达式类型未知：{0}

source: Expression:
zh_cn: 表达式:

source: Extend Class from
zh_cn: 扩展类从

source: Extend Selection
zh_cn: 扩展选择

source: Extended by
zh_cn: 补继承

source: Extended/implemented by
zh_cn: 被继承/被实现

source: Extends list
zh_cn: Extends 列表

source: Extends/implements
zh_cn: 继承/实现

source: Extends/implements keyword
zh_cn: Extends/implements 关键字

source: Extends/implements list
zh_cn: Extends/implements 列表

source: Extension method should have a body
zh_cn: 继承方法应该有方法体

source: Extension methods
zh_cn: 继承方法

source: Extension methods can only be used within an interface
zh_cn: 继承方法只能在接口内使用

source: Extension:
zh_cn: 扩展名:

source: External Annotations
zh_cn: 外部注解

source: External Diff
zh_cn: 外部比较

source: External JavaDoc override JavaDoc annotations you might have in your module.</html>
zh_cn: 外部 JavaDoc 覆盖您可能在您的模块中的 JavaDoc 注释。</html>

source: External Libraries
zh_cn: 外部库

source: External Resource
zh_cn: 外部资源

source: External Tools
zh_cn: 外部工具

source: External annotation prompt
zh_cn: 外部注解提示

source: External annotations would be saved in appropriate folder
zh_cn: 外部注释将保存在适当的文件夹中

source: External change
zh_cn: 外部更改

source: External file changes sync may be slow
zh_cn: 外部文件的变化同步可能是缓慢的

source: External resource {0} is not registered
zh_cn: 外部资源 {0} 未注册

source: External tool ''{0}''
zh_cn: 外部工具 ''{0}''

source: External tool ''{0}'' completed with exit code {1}
zh_cn: 外部工具 ''{0}'' 完成,退出码 {1}

source: Extract &chained constructor
zh_cn: 提取链式构造函数(&C)

source: Extract Artifact
zh_cn: 提取 Artifact

source: Extract Artifact...
zh_cn: 提取 Artifact...

source: Extract Constant
zh_cn: 提取常量

source: Extract Delegate
zh_cn: 提取委托

source: Extract Field
zh_cn: 提取字段

source: Extract Functional Parameter
zh_cn: 提取函数参数

source: Extract Functional Variable
zh_cn: 提取函数变量

source: Extract If Condition
zh_cn: 提取 if 条件

source: Extract Include File
zh_cn: 提取包含文件

source: Extract Interface
zh_cn: 提取接口

source: Extract Method
zh_cn: 提取方法

source: Extract Parameter
zh_cn: 提取参数

source: Extract Set from comparison chain
zh_cn: 从比较链中提取集合

source: Extract Subclass
zh_cn: 提取子类

source: Extract Superclass
zh_cn: 提取超类

source: Extract Variable
zh_cn: 提取变量

source: Extract Variable refactoring
zh_cn: 提取变量重构

source: Extract as &enum constant
zh_cn: 提取为枚举常量(&E)

source: Extract common part from 'if' {0}
zh_cn: 从 'if' {0} 中提取公共部分

source: Extract common part removing branch {0}
zh_cn: 提取公共部分删除分支 {0}

source: Extract common part with variables from 'if' {0}
zh_cn: 从 'if' {0} 中提取公共部分为变量

source: Extract common parts of 'if' statement
zh_cn: 提取 'if' 语句的公共部分

source: Extract if ({0})
zh_cn: 提取 if ({0})

source: Extract include file
zh_cn: 提取包含文件

source: Extract interface from the selected class
zh_cn: 从选中类提取接口

source: Extract interface from:
zh_cn: 提取接口从:

source: Extract method from duplicate code
zh_cn: 从重复代码中提取方法

source: Extract module from the selected class
zh_cn: 从选中类中提取模块

source: Extract parameter to method:
zh_cn: 提取参数到方法：

source: Extract side effects as an 'if' statement
zh_cn: 将副作用提取为 'if' 语句

source: Extract side {0, choice, 1#effect|2#effects}
zh_cn: 提取副作用

source: Extract superclass from the selected class
zh_cn: 从选中类提取超类

source: Extract superclass from:
zh_cn: 提取超类从:

source: Extract superclass with members to directory
zh_cn: 提取超类与成员到目录

source: Extract to &class (fully qualified name):
zh_cn: 提取到类(完全限定名)：(&C)

source: Extract to &directory:
zh_cn: 导出到目录:(&D)

source: Extract to separate mapping method
zh_cn: 提取到单独的映射方法

source: Extract variable ''{0}'' to ''{1}'' operation
zh_cn: 提取变量 ''{0}'' 到 ''{1}'' 操作

source: Extract variables from 'if' {0}
zh_cn: 从 'if' {0} 中提取变量

source: Extracting interface {0} from {1}
zh_cn: 提取接口 {0} 从 {1}

source: Extracting method
zh_cn: 提取方法

source: Extracting parameter to {0}
zh_cn: 参数提取到 {0}

source: Extracting superclass {0} from {1}
zh_cn: 提取超类 {0} 从 {1}

source: F&orward
zh_cn: 向前(&O)

source: F12
zh_cn: F12 返回上一次激活的工具窗口

source: F_ile Structure
zh_cn: 文件结构(_I)

source: F_ind Usages in File
zh_cn: 在文件中查找使用(_I)

source: Facet type isn't specified
zh_cn: Facet 类型未指定

source: Factory method name:
zh_cn: 工厂方法名称：

source: Failed
zh_cn: 失败

source: Failed commit: {0}
zh_cn: 提交失败:{0}

source: Failed to Create Class
zh_cn: 创建类失败

source: Failed to Download
zh_cn: 下载失败了

source: Failed to Start
zh_cn: 启动失败

source: Failed to apply patch for file {0}: {1}
zh_cn: 无法为文件 {0} 应用补丁：{1}

source: Failed to backup file {0}
zh_cn: 无法备份文件 {0}

source: Failed to capture snapshot: {0}
zh_cn: 无法捕获快照：{0}

source: Failed to check for updates to {0}: {1}
zh_cn: 无法检查更新 {0}: {1}

source: Failed to clean quarantine status: {0}
zh_cn: 清除隔离状态失败： {0}

source: Failed to create directory "{0}"
zh_cn: 无法创建目录 "{0}"

source: Failed to create directory {0}
zh_cn: 创建目录失败 {0}

source: Failed to create output file ''{0}''
zh_cn: 无法创建输出文件 ''{0}''

source: Failed to delete {0}
zh_cn: 删除 {0} 失败

source: Failed to download ''{0}'': {1}
zh_cn: 下载失败 ''{0}'': {1}

source: Failed to establish connection to the target VM, address: ''{0}'', transport: ''{1}''
zh_cn: 未能与目标虚拟机建立连接，地址:''{0}''，传输:''{1}''

source: Failed to evaluate breakpoint condition ''{0}'' Reason: {1}
zh_cn: 无法解析断点条件 ''{0}'' 原因: {1}

source: Failed to find any patches in the specified file
zh_cn: 在指定文件没有找到任何补丁

source: Failed to generate ant build script: {0}
zh_cn: 无法生成 Ant 构建脚本: {0}

source: Failed to generate temporary html wrapper for applet class
zh_cn: 无法为 applet 类生成临时 HTML 包装器

source: Failed to load patch base revision for file {0}: {1}
zh_cn: 无法为文件 {0} 加载补丁基本版本：{1}

source: Failed to load plugin descriptions from: "{0}"
zh_cn: 无法从: "{0}" 中加载插件说明

source: Failed to load renaming scheme from {0}: {1}
zh_cn: 无法从 {0} 加载重命名方案： {1}

source: Failed to load type(s)
zh_cn: 未能加载类型

source: Failed to make the following files writable:{0}
zh_cn: 未能将下列文件改为可写: {0}

source: Failed to make {0} writeable.
zh_cn: 未能将文件改为可写: {0}。

source: Failed to prepare an update:<br>{0}<br><a href="#">Open download page</a>.
zh_cn: 准备更新失败：<br>{0}<br><a href="#">打开下载页</a>.

source: Failed to save changes: {0}
zh_cn: 未能保存更改:{0}

source: Failed to save renaming scheme: {0}
zh_cn: 无法保存重命名方案： {0}

source: Failed to start
zh_cn: 启动失败

source: Failed:
zh_cn: 失败:

source: Fallback font:
zh_cn: 备用字体：

source: Favorites View Popup Menu
zh_cn: 收藏视图弹出菜单

source: Favorites list with name ''{0}'' already exists
zh_cn: 名为 ''{0}'' 的收藏列表已经存在

source: Feature
zh_cn: 功能

source: Feature is not supported by the target VM
zh_cn: 目标 VM 不支持功能

source: Feel &lucky
zh_cn: 感觉幸运(&L)

source: Fetch external resource
zh_cn: 获取外部资源

source: Fetches last element of an array
zh_cn: 获取数组的最后一个元素

source: Fetching Documentation...
zh_cn: 获取文档...

source: Fetching available updates for external components
zh_cn: 获取外部组件的可用更新

source: Fetching resource
zh_cn: 获取资源

source: Fetching {0}
zh_cn: 获取 {0}

source: Field
zh_cn: 字段

source: Field &declaration
zh_cn: 字段声明(&D)

source: Field &modification
zh_cn: 字段修改器(&M)

source: Field ''{0}'' is already defined in a single static import
zh_cn: 字段 ''{0}'' 已经在单个静态导入中定义

source: Field ''{0}'' is ambiguous in a single static import
zh_cn: 字段 ''{0}'' 在单个静态导入中是不明确的

source: Field ''{0}'' is never used
zh_cn: 字段 ''{0}'' 从未使用

source: Field ''{0}'' is not declared in class ''{1}''
zh_cn: 字段 ''{0}'' 未在类 ''{1}'' 中声明

source: Field ''{0}'' is not public
zh_cn: 字段 ''{0}'' 不是公共的

source: Field ''{0}'' is not static
zh_cn: 字段 ''{0}'' 是非静态的

source: Field ''{0}'' is static
zh_cn: 字段 ''{0}'' 是静态的

source: Field ''{2}'' not found
zh_cn: 未找到字段 ''{2}''

source: Field Already Exists
zh_cn: 字段已经存在

source: Field acce&ss
zh_cn: 字段访问器(&S)

source: Field annotations
zh_cn: 字段注释

source: Field can be converted to a local variable
zh_cn: 字段可以被转换为一个局部变量

source: Field can be local
zh_cn: 字段可以是局部的

source: Field declaration
zh_cn: 字段声明

source: Field has no usages.
zh_cn: 字段没有使用。

source: Field has one usage but it is not reachable from entry points.
zh_cn: 字段有一个用法，但从入口点无法访问。

source: Field has {0, choice, 1#1 usage|2#{0,number} usages} but they are not reachable from entry points.
zh_cn: 字段有 {0, choice, 1#1 个使用|2#{0,number} 个使用} ，但从入口点无法访问。

source: Field is assigned but never accessed.
zh_cn: 字段已赋值，但未被访问。

source: Field is never assigned.
zh_cn: 字段从未赋值。

source: Field name:
zh_cn: 字段名：
